#3. Реализовать функцию my_func(), которая принимает три позиционных
#аргумента, и возвращает сумму наибольших двух аргументов.

my_func = [1, 5, 3]
my_func.remove(min(my_func))
print(my_func)
